#include <iostream>
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
using namespace std;

int main() {
	//if分支语句
	//if语句的结构
	if (1 == 1/*判断的条件*/) {
		//判断结果为true后执行的内容
		cout << "1 = 1" << endl;
	}
	if (1 + 1 == 1) {
		//如果判断结果为false，就不会执行里面的内容
		cout << "1 + 1 = 1" << endl;
	}
	
	//同样，判断变量也是可以的
	int hp = 100;
	if (hp <= 0) {
		cout << "游戏结束";
	}

	hp = 0;

	if (hp <= 0) {
		cout << "游戏结束（1）" << endl;
	}
	

	//同样，if语句也可以不加{}
	if (1 + 1 == 2)
		cout << "1 + 1 = 2" << endl;

	cout << '\n';
	cout << "-----------------------------------------";
	cout << '\n';
	
	//拓展：else分支
	if (1 + 1 == 1) {
		cout << "1 + 1 = 1" << endl;
	}
	else {
		cout << "1 + 1 ≠ 1" << endl;
	}
	//由于1+1不等于1，所以将会执行else分支里的内容

	cout << '\n';
	cout << "-----------------------------------------";
	cout << '\n';

	//实例：实名制认证
	//划分为三个年龄段：未成年（<18），成年（>=18、< 50），老年（>= 50）
	//未成年游戏时长：2小时；成年游戏时长：10小时；老年游戏时长：3小时
	//特别注意！超过80的老年人就不能玩游戏了
	int age;
	cout << "请输入您的年龄：";
	cin >> age;
	if (age < 18) {
		cout << "您是未成年人，游戏时长为2小时" << endl;
	}
	else if (age < 50) {     //else if是否则如果的意思，意为if为false，则执行else if
		cout << "您是成年人，游戏时长为10小时" << endl;
	}
	else if (age < 80) {
		cout << "您是不超过80岁的老年人，游戏时长为3小时" << endl;
	}
	else {
		cout << "您是超过80岁的老年人，游戏时长为0小时（禁止游玩）" << endl;
	}
	
	
	return 0;
}