#include <iostream>
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
using namespace std;

int main() {
	//do while循环
	//循环结构：
	int i = 0;//初始化
	do {
		//循环体
		cout << "Hello World!" << endl;
		i++;  //更新
	} while (i < 10/*执行循环的条件*/);   //分号

	cout << '\n';
	cout << "-----------------------------------------------------" << endl;
	cout << '\n';

	//清爽版
	int j = 0;
	do {
		cout << "Hello C++!" << endl;
		j++;
	}while(j < 10);

	cout << '\n';
	cout << "-----------------------------------------------------" << endl;
	cout << '\n';
	
	//for循环遍历数组（简单版）
	int score[] = { 100, 90, 75, 54, 89, 95, 85, 78, 86, 48 };
	//C++获取数组长度的方法较复杂，所以我们直接数长度就好了，长度：10
	for (int k = 0; k < 10; k++) {    //为什么不是k <= 10呢？因为索引是从0开始的，10就超出长度了
		cout << "第" << k + 1 << "个元素的值是：" << score[k] << endl;
	}
	
	cout << '\n';
	cout << "-----------------------------------------------------" << endl;
	cout << '\n';
	
	//这种遍历方式稍微麻烦一点，所以以下为简单版
	//这种方式为C++特有
	//同样，遍历score数组
	int count0 = 0;
	for (int l /*临时变量创建*/ :/*注意此处为冒号*/ score/*需要遍历的数组*/) {
		//循环体
		count0++;
		cout << "第" << count0 << "个元素的值是：" << l/*此处直接写l就可以了，因为数组的值已经赋值给l了*/
			<< endl;
	}
	
	cout << '\n';
	
	
	//清爽版：
	int count1 = 0;
	for (int m : score) {
		count1++;
		cout << "第" << count1 << "个元素的值是：" << m << endl;
	}

	cout << '\n';
	cout << "-----------------------------------------------------" << endl;
	cout << '\n';

	//使用遍历批量修改值
	int count2 = 0;
	for (int&/*注意此处一定要有&才能修改值*/ n : score) {
		n = 100;
		count2++;
		cout << "第" << count2 << "个元素的值修改成功" << endl;
	}
	
	cout << '\n';
	
	//再次使用for循环遍历score
	count2 = 0;
	for (int o : score) {
		count2++;
		cout << "第" << count2 << "个元素的值修改后是：" << o << endl;
	}
	
	
	return 0;
}