#include <iostream>
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
using namespace std;

int main() {
	//二维列表和循环嵌套
	int score1[] = { 98,78,45,88,68,89,53,49,93,49 };   //定义了一个一维数组score1
	int score2[3/*表示数组里有几个数组*/][15/*这个数组中的每个数组有多少个元素*/]/*注意二维数组要有两个[]*/
	{
		{55,89,48,56,58},
		{47,78,89,84,80},
		{48,78,48,49,48}
	};  //定义了一个二维数组score2
	
	//访问二维数组
	cout << "二维数组中第一个数组的第一个元素是" << score2[0][0] << endl;
	//访问二维数组中第一个数组的第一个元素
	
	cout << "二维数组中第三个数组的第四个元素是" << score2[2][3] << endl;
	//访问二维数组中第三个数组的第四个元素

	cout << '\n';
	cout << "-----------------------------------------" << endl;
	cout << '\n';

	//遍历二维数组
	for (int i = 0; i < 3/*此处的数字是二维数组中有的数组数量*/; i++) {
		for (int j = 0; j < 5/*此处是二维数组中个数组有的元素个数*/; j++) {
			cout << "score2的第" << i + 1 << "个数组的第" << j + 1 << "个元素是" << score2[i][j] 
				<< endl;
		}
	}
	//此处为遍历二维数组，还有一个知识点：循环结构的嵌套

	cout << '\n';
	cout << "-----------------------------------------" << endl;
	cout << '\n';
	
	//遍历二维数组不仅可以先行后列，还可以先列后行
	//如下：
	for (int k = 0; k < 5/*此处的k作为列存在*/; k++) {
		for (int l = 0;l < 3/*此处的l作为行存在*/; l++) {
			cout << "score2的第" << l + 1 << "个数组的第" << k + 1 << "个元素是" << score2[l][k]
				<< endl;
			}
		}
		

	
	return 0;
}