#include <iostream>
#include <climits>
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
//运行该项目时一定要将它设为启动项！！！
using namespace std;

int main() {
	//知识点：整型

	short a = 3;            //定义一个短整型变量a
	int b = 30;             //定义一个正整型变量b
	long c = 300;           //定义一个长整型变量c
	long long d = 30000;    //定义一个超长整型变量d

	unsigned e = 20;        //定义一个无符号整型变量e（无符号整型不能使用负数）   
	                        //unsighed（无符号整型）也可以写为unsigned int，int可以省略
/*  短整型变量可以存储-32768 ~ 32767的数
	正整型变量可以存储-2147483648 ~ 2147483647的数n
	长整型变量可以存储-2147483648 ~ 2147483647的数
	超长整型变量可以存储-9223372036854775808 ~ 9223372036854775807的数   */

	cout << "a的值是：" << a << endl
		<< "b的值是：" << b << endl
		<< "c的值是：" << c << endl
		<< "d的值是：" << d << endl
		<< "e的值是：" << e << endl;

	int stop;
	cin >> stop;
	return 0;
}